export const questions = [
  {
    number: "Q1",
    question: "업무에서 가장 우선시해야 하는 것은 무엇이라고 생각하나요?",
    choices: [
      {
        text: "업무의 품질과 완성도",
        value: "",
      },
      { text: "업무를 빠르게 처리하고 데드라인을 준수하기", value: "" },
    ],
  },
  {
    number: "Q2",
    question: "팀 작업을 진행할 때, 어떤 유형의 업무 스타일인가요?",
    choices: [
      { text: "계획적이고 체계적인 업무 스타일", value: "A" },
      {
        text: "융통성 있고 적응력 있는 업무 스타일",
        value: "B",
      },
    ],
  },
  {
    number: "Q3",
    question: "업무를 진행할 때, 어떤 작업 환경이 더 효율적인가요?",
    choices: [
      { text: "조용하고 고립된 개인실에서 일하는 것", value: "C" },
      {
        text: "활발하고 사람들과 협업하는 개방적인 오피스 환경에서 일하는 것",
        value: "D",
      },
    ],
  },
  {
    number: "Q4",
    question: "업무를 진행할 때, 어떤 방식이 더 효과적이라고 생각하나요?",
    choices: [
      {
        text: "업무를 체계적으로 계획하고 하나씩 처리하는 것",
        value: "E",
      },
      {
        text: "여러 가지 일을 동시에 처리하고 다양한 관점에서 접근하는 것",
        value: "F",
      },
    ],
  },
  {
    number: "Q5",
    question: "업무에서 발생하는 문제에 대한 대처 방식은 어떤 것을 선호하나요?",
    choices: [
      { text: "문제를 공유하고 팀으로 해결하기", value: "" },
      {
        text: "개인적으로 문제를 해결하려고 노력하기",
        value: "",
      },
    ],
  },
  {
    number: "Q6",
    question: "팀 작업에서 가장 어려운 부분은 무엇이라고 생각하나요?",
    choices: [
      { text: "창의적인 아이디어를 생성하고 문제를 해결하는 역할", value: "" },
      { text: "업무를 체계적으로 관리하고 일정을 조정하는 역할", value: "" },
    ],
  },
  {
    number: "Q7",
    question: "팀원 간의 의사소통 시 중요하게 생각하는 가치관은 무엇인가요?",
    choices: [
      {
        text: "정기적인 회의와 개방적인 피드백을 받는 것",
        value: "",
      },
      { text: "필요할 때마다 빠르게 의견을 나누는 것", value: "" },
    ],
  },
  {
    number: "Q8",
    question:
      "팀 작업이 끝난 후, 성공적으로 완료된 것에 대한 축하 방법은 무엇이라고 생각하나요?",
    choices: [
      {
        text: "작은 파티나 간단한 간식 모임",
        value: "G",
      },
      {
        text: "각자가 원하는 보상이나 선물",
        value: "H",
      },
    ],
  },
];
export const results = [
  {
    title: "정직하게 나의 할 일을 하는",
    tool: "삽",
    character: "/images/삽.png",
    results: [
      "할 일을 정확하게 알고, 계획적으로 잘 해내는 당신은 <br>삽 스타일입니다. 팀원들 사이에서 프로젝트 기여도가 높다는 좋은 평가를 받는 경우가 많아요. 정직히 일하는 당신 덕분에 오늘도 팀 프로젝트를 무사히 마쳤답니다!",
    ],
  },
  {
    title: "무엇보다 행동이 먼저!",
    tool: "맨손",
    character: "/images/손.png",
    results: [
      "누구보다 행동력이 빠른 당신은 맨손 스타일입니다. <br>눈앞에 해결할 도구가 보이지 않아도 어떻게든 시작해 보는 남다른 실천력으로, 팀 프로젝트에서 다양한 시도를 해볼 수 있어요. 팀원들 사이에서 당신의 별명은... 행동대장!",
    ],
  },
  {
    title: "언제나 꼼꼼하게 끈기 가득한",
    tool: "모종삽",
    character: "/images/모종삽.png",
    results: [
      "차근차근하게 사소한 부분도 놓치지 않는 당신은 모종삽 스타입입니다. 앞에 나서서 팀을 이끌진 않아도, 묵묵히 엄청난 능력을 발휘하고 있는 당신! 당신은 모르겠지만 <br>그 노력의 결과는 언젠가 큰 성과로 나타날 것이랍니다!",
    ],
  },
  {
    title: "무슨 일이든 즐기면서 할 줄 아는",
    tool: "장난감삽",
    character: "/images/장난감삽.png",
    results: [
      "긍정적인 마인드로 할 일을 즐겁게 하는 당신은 장난감 삽 스타입니다. 팀원들 사이에서 분위기 메이커로 불리지 않나요? 같은 일이더라도 즐기면서 한다면 업무 효율이 쑥쑥! 앞으로 우리가 마주할 팀 프로젝트도 잘 부탁해요!",
    ],
  },
  {
    title: "효율적으로 많은 일을 해결하는",
    tool: "포크레인",
    character: "/images/포크레인.png",
    results: [
      "한 번에 많은 일을 해결하고, 효율을 중시하는 당신은 포크레인 스타일입니다. 보통 팀 내에서 결정권을 가지고 있지 않나요? 이성적인 가치판단으로 팀 프로젝트가 흔들리지 않고 앞으로 나아가게 해주는 역할을 한답니다!",
    ],
  },
  {
    title: "남다른 아이디어로 한방을 노리는",
    tool: "다이너마이트",
    character: "/images/다이너마이트.png",
    results: [
      "평소엔 조용해 보이지만 머릿속은 새로운 아이디어 생각 중인 당신은 다이너마이트 스타일입니다. 아이디어 뱅크 역할을 하며 남다른 기획력을 자랑하죠. 팀원분들, 놀랄 준비하세요. 이러다 언제 크게 한방 터질지 모르니까요!",
    ],
  },
];
export const testtypes = {
  ADEG: 0, //삽
  ACEG: 0,
  ACEH: 0,
  BDEG: 1, //손
  BDEH: 1,
  BCFG: 2, //모종삽
  ACFG: 2,
  ACFH: 2,
  BDFH: 3, //장난감삽
  BDFG: 3,
  ADFH: 4, //포크레인
  BCEH: 4,
  BCFH: 4,
  BCEG: 5, //다이너마이트
  ADFG: 5,
  ADEH: 5,
};
